Tekla.Structures.Analysis.AnalysisModelAnalysisProperties
The AnalysisModelAnalysisProperties class contains the analysis property information for an analysis model.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties._AnalysisMethod
Defines analysis method.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties._MaxIterations
Number of maximun iterations.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties._AccuracyOfIterations
Accuracy value for interations.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.#ctor
Creates a new analysis model analysis properties instance.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AnalysisMethod
The analysis method.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.MaxIterations
The maximum number of iterations.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AccuracyOfIterations
The accuracy of the iterations.